[NoCoverage] BlockStatement
components/atoms/Button/Button.tsx:8:57
   children?: ReactNode;
 }
 
-const Button = ({ children, ...props }: ButtonProps) => {
-  return (
-    <button className={styles.button} {...props}>
-      {children}
-    </button>
-  );
-};
+const Button = ({ children, ...props }: ButtonProps) => {};
 
 export default Button;
