[NoCoverage] BlockStatement
components/atoms/Input/Input.tsx:10:51
 }
 
 const Input = forwardRef<HTMLInputElement, InputProps>(
-  ({ label, error, className, ...props }, ref) => {
-    return (
-      <div className={styles.wrapper}>
-        {label && <label className={styles.label}>{label}</label>}
-
-        <input
-          ref={ref}
-          className={`${styles.input} ${className ?? ""}`}
-          {...props}
-        />
-
-        {error && <span className={styles.error}>{error}</span>}
-      </div>
-    );
-  },
+  ({ label, error, className, ...props }, ref) => {},
 );
 

[NoCoverage] ConditionalExpression
components/atoms/Input/Input.tsx:13:10
   ({ label, error, className, ...props }, ref) => {
     return (
       <div className={styles.wrapper}>
-        {label && <label className={styles.label}>{label}</label>}
+        {false}
 
         <input

[NoCoverage] ConditionalExpression
components/atoms/Input/Input.tsx:13:10
   ({ label, error, className, ...props }, ref) => {
     return (
       <div className={styles.wrapper}>
-        {label && <label className={styles.label}>{label}</label>}
+        {true}
 
         <input

[NoCoverage] LogicalOperator
components/atoms/Input/Input.tsx:17:41
 
         <input
           ref={ref}
-          className={`${styles.input} ${className ?? ""}`}
+          className={`${styles.input} ${className && ""}`}
           {...props}
         />

[NoCoverage] StringLiteral
components/atoms/Input/Input.tsx:17:54
 
         <input
           ref={ref}
-          className={`${styles.input} ${className ?? ""}`}
+          className={`${styles.input} ${className ?? "Stryker was here!"}`}
           {...props}
         />

[NoCoverage] ConditionalExpression
components/atoms/Input/Input.tsx:21:10
           {...props}
         />
 
-        {error && <span className={styles.error}>{error}</span>}
+        {false}
       </div>
     );

[NoCoverage] ConditionalExpression
components/atoms/Input/Input.tsx:21:10
           {...props}
         />
 
-        {error && <span className={styles.error}>{error}</span>}
+        {true}
       </div>
     );
