[NoCoverage] StringLiteral
components/molecules/SearchBar/SearchBar.tsx:15:17
 export default function SearchBar({
   value,
   onChange,
-  placeholder = "Search...",
+  placeholder = "",
 }: SearchBarProps) {
   return (

[NoCoverage] BlockStatement
components/molecules/SearchBar/SearchBar.tsx:16:20
   value,
   onChange,
   placeholder = "Search...",
-}: SearchBarProps) {
-  return (
-    <div className={styles.container}>
-      <Input
-        value={value}
-        placeholder={placeholder}
-        onChange={(e) => onChange(e.target.value)}
-      />
-    </div>
-  );
-}
+}: SearchBarProps) {}
 

[NoCoverage] ArrowFunction
components/molecules/SearchBar/SearchBar.tsx:22:19
       <Input
         value={value}
         placeholder={placeholder}
-        onChange={(e) => onChange(e.target.value)}
+        onChange={() => undefined}
       />
     </div>
