[NoCoverage] BlockStatement
components/organisms/CharacterDetail/CharacterDetail.tsx:16:19
 export default function CharacterDetail({ character }: Props) {
   const dispatch = useDispatch();
 
-  useEffect(() => {
-    dispatch(addRecent(character));
-  }, [character, dispatch]);
+  useEffect(() => {}, [character, dispatch]);
 
   return (
