[NoCoverage] BlockStatement
components/organisms/CharacterGrid/CharacterGrid.tsx:13:29
 import styles from "./CharacterGrid.module.scss";
 import Pagination from "@/components/molecules/Pagination/Pagination";
 
-const CharacterGrid = () => {
-  const search = useSelector((state: RootState) => state.search.value);
-  const [page, setPage] = useState(1);
-
-  const { data, isLoading, isError } = useCharacters(page, search);
-
-  if (isLoading) return <p>Loading...</p>;
-  if (isError) return <p>Error</p>;
-
-  return (
-    <div>
-      <div className={styles.grid}>
-        {data?.results.map((character) => (
-          <CharacterCard key={character.id} {...character} />
-        ))}
-      </div>
-      <Pagination
-        currentPage={page}
-        totalPages={data?.info?.pages || 1}
-        onChange={setPage}
-      />
-    </div>
-  );
-};
+const CharacterGrid = () => {};
 export default CharacterGrid;
 

[NoCoverage] ArrowFunction
components/organisms/CharacterGrid/CharacterGrid.tsx:14:30
 import Pagination from "@/components/molecules/Pagination/Pagination";
 
 const CharacterGrid = () => {
-  const search = useSelector((state: RootState) => state.search.value);
+  const search = useSelector(() => undefined);
   const [page, setPage] = useState(1);
 

[NoCoverage] ConditionalExpression
components/organisms/CharacterGrid/CharacterGrid.tsx:19:7
 
   const { data, isLoading, isError } = useCharacters(page, search);
 
-  if (isLoading) return <p>Loading...</p>;
+  if (false) return <p>Loading...</p>;
   if (isError) return <p>Error</p>;
 

[NoCoverage] ConditionalExpression
components/organisms/CharacterGrid/CharacterGrid.tsx:19:7
 
   const { data, isLoading, isError } = useCharacters(page, search);
 
-  if (isLoading) return <p>Loading...</p>;
+  if (true) return <p>Loading...</p>;
   if (isError) return <p>Error</p>;
 

[NoCoverage] ConditionalExpression
components/organisms/CharacterGrid/CharacterGrid.tsx:20:7
   const { data, isLoading, isError } = useCharacters(page, search);
 
   if (isLoading) return <p>Loading...</p>;
-  if (isError) return <p>Error</p>;
+  if (false) return <p>Error</p>;
 
   return (

[NoCoverage] ConditionalExpression
components/organisms/CharacterGrid/CharacterGrid.tsx:20:7
   const { data, isLoading, isError } = useCharacters(page, search);
 
   if (isLoading) return <p>Loading...</p>;
-  if (isError) return <p>Error</p>;
+  if (true) return <p>Error</p>;
 
   return (

[NoCoverage] ArrowFunction
components/organisms/CharacterGrid/CharacterGrid.tsx:25:28
   return (
     <div>
       <div className={styles.grid}>
-        {data?.results.map((character) => (
-          <CharacterCard key={character.id} {...character} />
-        ))}
+        {data?.results.map(() => undefined)}
       </div>
       <Pagination

[NoCoverage] OptionalChaining
components/organisms/CharacterGrid/CharacterGrid.tsx:25:10
   return (
     <div>
       <div className={styles.grid}>
-        {data?.results.map((character) => (
+        {data.results.map((character) => (
           <CharacterCard key={character.id} {...character} />
         ))}

[NoCoverage] OptionalChaining
components/organisms/CharacterGrid/CharacterGrid.tsx:31:21
       </div>
       <Pagination
         currentPage={page}
-        totalPages={data?.info?.pages || 1}
+        totalPages={data?.info.pages || 1}
         onChange={setPage}
       />

[NoCoverage] ConditionalExpression
components/organisms/CharacterGrid/CharacterGrid.tsx:31:21
       </div>
       <Pagination
         currentPage={page}
-        totalPages={data?.info?.pages || 1}
+        totalPages={true}
         onChange={setPage}
       />
