[NoCoverage] BlockStatement
components/organisms/Header/Header.tsx:9:34
 import SearchBar from "../../molecules/SearchBar/SearchBar";
 import styles from "./Header.module.scss";
 
-export default function Header() {
-  const dispatch = useDispatch();
-  const search = useSelector((state: RootState) => state.search.value);
-
-  return (
-    <header className={styles.header}>
-      <div className={styles.inner}>
-        <Link href="/" className={styles.logo}>
-          Rick & Morty
-        </Link>
-        <SearchBar
-          value={search}
-          onChange={(value) => dispatch(setSearch(value))}
-          placeholder="Search character..."
-        />
-      </div>
-    </header>
-  );
-}
+export default function Header() {}
 

[NoCoverage] ArrowFunction
components/organisms/Header/Header.tsx:11:30
 
 export default function Header() {
   const dispatch = useDispatch();
-  const search = useSelector((state: RootState) => state.search.value);
+  const search = useSelector(() => undefined);
 
   return (

[NoCoverage] ArrowFunction
components/organisms/Header/Header.tsx:21:21
         </Link>
         <SearchBar
           value={search}
-          onChange={(value) => dispatch(setSearch(value))}
+          onChange={() => undefined}
           placeholder="Search character..."
         />
