[NoCoverage] BlockStatement
components/organisms/RecentCharacters/RecentCharacters.tsx:5:32
 import CharacterCard from "../CharacterCard/CharacterCard";
 
 import styles from "./RecentCharacters.module.scss";
-const RecentCharacters = () => {
-  const recents = useSelector((state: RootState) => state.recent.items);
-
-  return (
-    <div className={styles.container}>
-      <h2 className={styles.title}>Recently Viewed</h2>
-      <div className={styles.grid}>
-        {recents.map((character) => (
-          <CharacterCard key={character.id} {...character} />
-        ))}
-      </div>
-    </div>
-  );
-};
+const RecentCharacters = () => {};
 
 export default RecentCharacters;

[NoCoverage] ArrowFunction
components/organisms/RecentCharacters/RecentCharacters.tsx:6:31
 
 import styles from "./RecentCharacters.module.scss";
 const RecentCharacters = () => {
-  const recents = useSelector((state: RootState) => state.recent.items);
+  const recents = useSelector(() => undefined);
 
   return (

[NoCoverage] ArrowFunction
components/organisms/RecentCharacters/RecentCharacters.tsx:12:22
     <div className={styles.container}>
       <h2 className={styles.title}>Recently Viewed</h2>
       <div className={styles.grid}>
-        {recents.map((character) => (
-          <CharacterCard key={character.id} {...character} />
-        ))}
+        {recents.map(() => undefined)}
       </div>
     </div>
