[Killed] MethodExpression
components/molecules/Pagination/Pagination.tsx:19:17
   const pages = [];
 
   // Define un rango de páginas visibles
-  const start = Math.max(1, currentPage - 2);
+  const start = Math.min(1, currentPage - 2);
   const end = Math.min(totalPages, currentPage + 2);
 
killedBy: Pagination renders ellipsis on both sides when pages are truncated
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 1
Received array:  [<span class="ellipsis">…</span>]

[Killed] ArithmeticOperator
components/molecules/Pagination/Pagination.tsx:19:29
   const pages = [];
 
   // Define un rango de páginas visibles
-  const start = Math.max(1, currentPage - 2);
+  const start = Math.max(1, currentPage + 2);
   const end = Math.min(totalPages, currentPage + 2);
 
killedBy: Pagination renders page numbers around the current page
statusReason: TestingLibraryElementError: Unable to find an element with the text: 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="pagination"
    >

[Killed] MethodExpression
components/molecules/Pagination/Pagination.tsx:20:15
 
   // Define un rango de páginas visibles
   const start = Math.max(1, currentPage - 2);
-  const end = Math.min(totalPages, currentPage + 2);
+  const end = Math.max(totalPages, currentPage + 2);
 
   for (let i = start; i <= end; i++) {
killedBy: Pagination renders ellipsis on both sides when pages are truncated
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 1
Received array:  [<span class="ellipsis">…</span>]

[Killed] ArithmeticOperator
components/molecules/Pagination/Pagination.tsx:20:36
 
   // Define un rango de páginas visibles
   const start = Math.max(1, currentPage - 2);
-  const end = Math.min(totalPages, currentPage + 2);
+  const end = Math.min(totalPages, currentPage - 2);
 
   for (let i = start; i <= end; i++) {
killedBy: Pagination renders page numbers around the current page
statusReason: TestingLibraryElementError: Unable to find an element with the text: 3. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="pagination"
    >

[Killed] EqualityOperator
components/molecules/Pagination/Pagination.tsx:22:23
   const start = Math.max(1, currentPage - 2);
   const end = Math.min(totalPages, currentPage + 2);
 
-  for (let i = start; i <= end; i++) {
+  for (let i = start; i > end; i++) {
     pages.push(i);
   }
killedBy: Pagination renders page numbers around the current page
statusReason: TestingLibraryElementError: Unable to find an element with the text: 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="pagination"
    >

[Killed] ConditionalExpression
components/molecules/Pagination/Pagination.tsx:22:23
   const start = Math.max(1, currentPage - 2);
   const end = Math.min(totalPages, currentPage + 2);
 
-  for (let i = start; i <= end; i++) {
+  for (let i = start; false; i++) {
     pages.push(i);
   }
killedBy: Pagination renders page numbers around the current page
statusReason: TestingLibraryElementError: Unable to find an element with the text: 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="pagination"
    >

[Killed] ArrowFunction
components/molecules/Pagination/Pagination.tsx:29:18
   return (
     <nav className={styles.pagination}>
       <button
-        onClick={() => onChange(1)}
+        onClick={() => undefined}
         disabled={currentPage === 1}
         aria-label="First page"
killedBy: Pagination calls onChange with page 1 when clicking first button
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1

Number of calls: 0

[Killed] ConditionalExpression
components/molecules/Pagination/Pagination.tsx:30:19
     <nav className={styles.pagination}>
       <button
         onClick={() => onChange(1)}
-        disabled={currentPage === 1}
+        disabled={false}
         aria-label="First page"
       >
killedBy: Pagination disables previous buttons on first page
statusReason: Error: expect(element).toBeDisabled()

Received element is not disabled:
  <button aria-label="First page" />

[Killed] ConditionalExpression
components/molecules/Pagination/Pagination.tsx:30:19
     <nav className={styles.pagination}>
       <button
         onClick={() => onChange(1)}
-        disabled={currentPage === 1}
+        disabled={true}
         aria-label="First page"
       >
killedBy: Pagination calls onChange with page 1 when clicking first button
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1

Number of calls: 0

[Killed] ArrowFunction
components/molecules/Pagination/Pagination.tsx:37:18
       </button>
 
       <button
-        onClick={() => onChange(currentPage - 1)}
+        onClick={() => undefined}
         disabled={currentPage === 1}
       >
killedBy: Pagination calls onChange with previous page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 2

Number of calls: 0

[Killed] ArithmeticOperator
components/molecules/Pagination/Pagination.tsx:37:33
       </button>
 
       <button
-        onClick={() => onChange(currentPage - 1)}
+        onClick={() => onChange(currentPage + 1)}
         disabled={currentPage === 1}
       >
killedBy: Pagination calls onChange with previous page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 2
Received: 4

Number of calls: 1

[Killed] EqualityOperator
components/molecules/Pagination/Pagination.tsx:38:19
 
       <button
         onClick={() => onChange(currentPage - 1)}
-        disabled={currentPage === 1}
+        disabled={currentPage !== 1}
       >
         ‹ Prev
killedBy: Pagination disables previous buttons on first page
statusReason: Error: expect(element).toBeDisabled()

Received element is not disabled:
  <button />

[Killed] ConditionalExpression
components/molecules/Pagination/Pagination.tsx:38:19
 
       <button
         onClick={() => onChange(currentPage - 1)}
-        disabled={currentPage === 1}
+        disabled={false}
       >
         ‹ Prev
killedBy: Pagination disables previous buttons on first page
statusReason: Error: expect(element).toBeDisabled()

Received element is not disabled:
  <button />

[Killed] EqualityOperator
components/molecules/Pagination/Pagination.tsx:43:8
         ‹ Prev
       </button>
 
-      {start > 1 && <span className={styles.ellipsis}>…</span>}
+      {start <= 1 && <span className={styles.ellipsis}>…</span>}
 
       {pages.map((page) => (
killedBy: Pagination renders ellipsis on both sides when pages are truncated
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 1
Received array:  [<span class="ellipsis">…</span>]

[Killed] LogicalOperator
components/molecules/Pagination/Pagination.tsx:43:8
         ‹ Prev
       </button>
 
-      {start > 1 && <span className={styles.ellipsis}>…</span>}
+      {start > 1 || <span className={styles.ellipsis}>…</span>}
 
       {pages.map((page) => (
killedBy: Pagination renders ellipsis on both sides when pages are truncated
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 1
Received array:  [<span class="ellipsis">…</span>]

[Killed] ArrowFunction
components/molecules/Pagination/Pagination.tsx:45:18
 
       {start > 1 && <span className={styles.ellipsis}>…</span>}
 
-      {pages.map((page) => (
-        <button
-          key={page}
-          className={page === currentPage ? styles.active : ""}
-          onClick={() => onChange(page)}
-        >
-          {page}
-        </button>
-      ))}
+      {pages.map(() => undefined)}
 
       {end < totalPages && <span className={styles.ellipsis}>…</span>}
killedBy: Pagination renders page numbers around the current page
statusReason: TestingLibraryElementError: Unable to find an element with the text: 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="pagination"
    >

[Survived] ConditionalExpression
components/molecules/Pagination/Pagination.tsx:48:22
       {pages.map((page) => (
         <button
           key={page}
-          className={page === currentPage ? styles.active : ""}
+          className={true ? styles.active : ""}
           onClick={() => onChange(page)}
         >

[Survived] ConditionalExpression
components/molecules/Pagination/Pagination.tsx:48:22
       {pages.map((page) => (
         <button
           key={page}
-          className={page === currentPage ? styles.active : ""}
+          className={false ? styles.active : ""}
           onClick={() => onChange(page)}
         >

[Killed] ArrowFunction
components/molecules/Pagination/Pagination.tsx:49:20
         <button
           key={page}
           className={page === currentPage ? styles.active : ""}
-          onClick={() => onChange(page)}
+          onClick={() => undefined}
         >
           {page}
killedBy: Pagination calls onChange when a page number is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 4

Number of calls: 0

[Killed] ConditionalExpression
components/molecules/Pagination/Pagination.tsx:55:8
         </button>
       ))}
 
-      {end < totalPages && <span className={styles.ellipsis}>…</span>}
+      {true}
 
       <button
killedBy: Pagination renders ellipsis on both sides when pages are truncated
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 1
Received array:  [<span class="ellipsis">…</span>]

[Killed] EqualityOperator
components/molecules/Pagination/Pagination.tsx:55:8
         </button>
       ))}
 
-      {end < totalPages && <span className={styles.ellipsis}>…</span>}
+      {end >= totalPages && <span className={styles.ellipsis}>…</span>}
 
       <button
killedBy: Pagination renders ellipsis on both sides when pages are truncated
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 1
Received array:  [<span class="ellipsis">…</span>]

[Killed] ArrowFunction
components/molecules/Pagination/Pagination.tsx:58:18
       {end < totalPages && <span className={styles.ellipsis}>…</span>}
 
       <button
-        onClick={() => onChange(currentPage + 1)}
+        onClick={() => undefined}
         disabled={currentPage === totalPages}
       >
killedBy: Pagination calls onChange with next page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 4

Number of calls: 0

[Killed] ArithmeticOperator
components/molecules/Pagination/Pagination.tsx:58:33
       {end < totalPages && <span className={styles.ellipsis}>…</span>}
 
       <button
-        onClick={() => onChange(currentPage + 1)}
+        onClick={() => onChange(currentPage - 1)}
         disabled={currentPage === totalPages}
       >
killedBy: Pagination calls onChange with next page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 4
Received: 2

Number of calls: 1

[Killed] ConditionalExpression
components/molecules/Pagination/Pagination.tsx:59:19
 
       <button
         onClick={() => onChange(currentPage + 1)}
-        disabled={currentPage === totalPages}
+        disabled={false}
       >
         Next ›
killedBy: Pagination disables next buttons on last page
statusReason: Error: expect(element).toBeDisabled()

Received element is not disabled:
  <button />

[Killed] EqualityOperator
components/molecules/Pagination/Pagination.tsx:59:19
 
       <button
         onClick={() => onChange(currentPage + 1)}
-        disabled={currentPage === totalPages}
+        disabled={currentPage !== totalPages}
       >
         Next ›
killedBy: Pagination disables next buttons on last page
statusReason: Error: expect(element).toBeDisabled()

Received element is not disabled:
  <button />

[Killed] ArrowFunction
components/molecules/Pagination/Pagination.tsx:65:18
       </button>
 
       <button
-        onClick={() => onChange(totalPages)}
+        onClick={() => undefined}
         disabled={currentPage === totalPages}
       >
killedBy: Pagination calls onChange with last page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 10

Number of calls: 0

[Killed] EqualityOperator
components/molecules/Pagination/Pagination.tsx:66:19
 
       <button
         onClick={() => onChange(totalPages)}
-        disabled={currentPage === totalPages}
+        disabled={currentPage !== totalPages}
       >
         »
killedBy: Pagination disables next buttons on last page
statusReason: Error: expect(element).toBeDisabled()

Received element is not disabled:
  <button />

[Killed] ConditionalExpression
components/molecules/Pagination/Pagination.tsx:66:19
 
       <button
         onClick={() => onChange(totalPages)}
-        disabled={currentPage === totalPages}
+        disabled={true}
       >
         »
killedBy: Pagination calls onChange with last page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 10

Number of calls: 0
